<h3><center>Data Munging</center></h3>

<h6><center>Dataframes</center></h6>

In [1]:
# Importing packages
import numpy as np
import pandas as pd
import string as str

In [2]:
# Creating dictionary
dicionario = {'Categoria1':[1, 2, 3], 'Categoria2':[4, 5, 6], 'Categoria3':[7, 8, 9], 'Categoria4':[10, 11, 12]};
dicionario

{'Categoria1': [1, 2, 3],
 'Categoria2': [4, 5, 6],
 'Categoria3': [7, 8, 9],
 'Categoria4': [10, 11, 12]}

In [3]:
# Creating Dataframe from dictionary
dataframe = pd.DataFrame(dicionario); dataframe

   Categoria1  Categoria2  Categoria3  Categoria4
0           1           4           7          10
1           2           5           8          11
2           3           6           9          12

In [4]:
# Types
dataframe.dtypes

Categoria1    int64
Categoria2    int64
Categoria3    int64
Categoria4    int64
dtype: object

In [5]:
# Recovering datas
dataframe['Categoria4']

0    10
1    11
2    12
Name: Categoria4, dtype: int64

In [6]:
# Recovering datas
dataframe['Categoria4'][2]

12

In [7]:
# My index
dataframe.index

RangeIndex(start=0, stop=3, step=1)

In [8]:
# Recovering from index in line
dataframe.iloc[1]

Categoria1     2
Categoria2     5
Categoria3     8
Categoria4    11
Name: 1, dtype: int64

In [9]:
# Recovering from index in line
dataframe[:2]

   Categoria1  Categoria2  Categoria3  Categoria4
0           1           4           7          10
1           2           5           8          11

In [10]:
# Adding a new column and change the index from the new column
dataframe.insert(0, 'Alpha', list(str.ascii_lowercase[:dataframe.index.size])); dataframe.set_index('Alpha')

       Categoria1  Categoria2  Categoria3  Categoria4
Alpha
a               1           4           7          10
b               2           5           8          11
c               3           6           9          12

In [20]:
# You're kidding
dataframe.T.set_axis(dataframe['Alpha'], axis='columns')[1:]

Alpha        a   b   c
Categoria1   1   2   3
Categoria2   4   5   6
Categoria3   7   8   9
Categoria4  10  11  12

In [21]:
# Head
dataframe.head()

  Alpha  Categoria1  Categoria2  Categoria3  Categoria4
0     a           1           4           7          10
1     b           2           5           8          11
2     c           3           6           9          12

In [22]:
# Columns
dataframe.columns

Index(['Alpha', 'Categoria1', 'Categoria2', 'Categoria3', 'Categoria4'], dtype='object')

In [23]:
# Sees the object
dataframe.index

RangeIndex(start=0, stop=3, step=1)

<h6><center>Dataframes - Data</center></h6>

In [24]:
# Using the data
dataframe.index = pd.date_range('3/3/1997', periods=3)

In [25]:
# The new index
dataframe

           Alpha  Categoria1  Categoria2  Categoria3  Categoria4
1997-03-03     a           1           4           7          10
1997-03-04     b           2           5           8          11
1997-03-05     c           3           6           9          12

In [35]:
# Recoverying the data from date
dataframe.iloc[0]

Alpha          a
Categoria1     1
Categoria2     4
Categoria3     7
Categoria4    10
Name: 1997-03-03 00:00:00, dtype: object

In [36]:
# Recoverying the data from date
dataframe['1997-03-03':'1997-03-04'].sort_values('Categoria4', ascending=False)

           Alpha  Categoria1  Categoria2  Categoria3  Categoria4
1997-03-04     b           2           5           8          11
1997-03-03     a           1           4           7          10